pg_bench/postgresql_bulk_insert_threads_20_time_60_tables_20_table_size_1000000.log
sysbench --threads=20 --time=60 --report-interval=10 --db-driver=pgsql bulk_insert --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=20 --table-size=1000000 prepare >> postgresql_bulk_insert_threads_20_time_60_tables_20_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Creating table 'sbtest1'...
Creating table 'sbtest2'...
Creating table 'sbtest3'...
Creating table 'sbtest4'...
Creating table 'sbtest5'...
Creating table 'sbtest6'...
Creating table 'sbtest7'...
Creating table 'sbtest8'...
Creating table 'sbtest9'...
Creating table 'sbtest10'...
Creating table 'sbtest11'...
Creating table 'sbtest12'...
Creating table 'sbtest13'...
Creating table 'sbtest14'...
Creating table 'sbtest15'...
Creating table 'sbtest16'...
Creating table 'sbtest17'...
Creating table 'sbtest18'...
Creating table 'sbtest19'...
Creating table 'sbtest20'...
sysbench --threads=20 --time=60 --report-interval=10 --db-driver=pgsql bulk_insert --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=20 --table-size=1000000 run >> postgresql_bulk_insert_threads_20_time_60_tables_20_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 20
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 20 tps: 519028.30 qps: 12.99 (r/w/o: 0.00/12.99/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 20 tps: 491325.20 qps: 14.99 (r/w/o: 0.00/14.99/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 20 tps: 448981.50 qps: 13.70 (r/w/o: 0.00/13.70/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 20 tps: 435460.38 qps: 13.29 (r/w/o: 0.00/13.29/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 20 tps: 483857.59 qps: 16.21 (r/w/o: 0.00/16.21/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 20 tps: 521325.12 qps: 18.00 (r/w/o: 0.00/18.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           931
        other:                           0
        total:                           931
    transactions:                        29002486 (480507.11 per sec.)
    queries:                             931    (15.42 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.3570s
    total number of events:              29002486

Latency (ms):
         min:                                    0.00
         avg:                                    0.04
         max:                                 2487.34
         95th percentile:                        0.00
         sum:                              1190305.04

Threads fairness:
    events (avg/stddev):           1450124.3000/45542.52
    execution time (avg/stddev):   59.5153/0.13

sysbench --threads=20 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=20 --table-size=1000000 cleanup >> postgresql_bulk_insert_threads_20_time_60_tables_20_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
Dropping table 'sbtest11'...
Dropping table 'sbtest12'...
Dropping table 'sbtest13'...
Dropping table 'sbtest14'...
Dropping table 'sbtest15'...
Dropping table 'sbtest16'...
Dropping table 'sbtest17'...
Dropping table 'sbtest18'...
Dropping table 'sbtest19'...
Dropping table 'sbtest20'...