pg_bench/postgresql_bulk_insert_threads_2_time_60_tables_2_table_size_10000.log
sysbench --threads=2 --time=60 --report-interval=10 --db-driver=pgsql bulk_insert --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=10000 prepare >> postgresql_bulk_insert_threads_2_time_60_tables_2_table_size_10000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Creating table 'sbtest1'...
Creating table 'sbtest2'...
sysbench --threads=2 --time=60 --report-interval=10 --db-driver=pgsql bulk_insert --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=10000 run >> postgresql_bulk_insert_threads_2_time_60_tables_2_table_size_10000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 2 tps: 688454.63 qps: 22.59 (r/w/o: 0.00/22.59/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 687401.24 qps: 23.60 (r/w/o: 0.00/23.60/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 702030.58 qps: 24.40 (r/w/o: 0.00/24.40/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 710394.46 qps: 27.10 (r/w/o: 0.00/27.10/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 749623.28 qps: 28.60 (r/w/o: 0.00/28.60/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 2 tps: 762846.76 qps: 29.10 (r/w/o: 0.00/29.10/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1558
        other:                           0
        total:                           1558
    transactions:                        43009328 (716183.63 per sec.)
    queries:                             1558   (25.94 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0526s
    total number of events:              43009328

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                  287.08
         95th percentile:                        0.00
         sum:                               111429.54

Threads fairness:
    events (avg/stddev):           21504664.0000/26213.00
    execution time (avg/stddev):   55.7148/0.01

sysbench --threads=2 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=10000 cleanup >> postgresql_bulk_insert_threads_2_time_60_tables_2_table_size_10000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...