pg_bench/postgresql_bulk_insert_threads_2_time_60_tables_2_table_size_1000000.log
sysbench --threads=2 --time=60 --report-interval=10 --db-driver=pgsql bulk_insert --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=1000000 prepare >> postgresql_bulk_insert_threads_2_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Creating table 'sbtest1'...
Creating table 'sbtest2'...
sysbench --threads=2 --time=60 --report-interval=10 --db-driver=pgsql bulk_insert --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=1000000 run >> postgresql_bulk_insert_threads_2_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 2 tps: 694338.09 qps: 22.79 (r/w/o: 0.00/22.79/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 687379.26 qps: 23.60 (r/w/o: 0.00/23.60/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 690815.57 qps: 24.00 (r/w/o: 0.00/24.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 707884.54 qps: 27.01 (r/w/o: 0.00/27.01/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 563563.12 qps: 21.50 (r/w/o: 0.00/21.50/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 2 tps: 618559.24 qps: 23.60 (r/w/o: 0.00/23.60/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1429
        other:                           0
        total:                           1429
    transactions:                        39627851 (659464.89 per sec.)
    queries:                             1429   (23.78 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0896s
    total number of events:              39627851

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                  379.26
         95th percentile:                        0.00
         sum:                               111813.82

Threads fairness:
    events (avg/stddev):           19813925.5000/13106.50
    execution time (avg/stddev):   55.9069/0.01

sysbench --threads=2 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5434 --pgsql-user=sbtest --pgsql-password=sbtest --pgsql-db=sbtest --tables=2 --table-size=1000000 cleanup >> postgresql_bulk_insert_threads_2_time_60_tables_2_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...